---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CoarseScaleFillPatternColor
source: html/c87e6547-fb40-b55a-23f8-caea4b5a3360.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CoarseScaleFillPatternColor Property

"Coarse Scale Fill Color"

## Syntax (C#)
```csharp
public static ForgeTypeId CoarseScaleFillPatternColor { get; }
```